In [1]:
import pandas as pd

In [77]:
data = pd.read_csv('../jupyter_pr/data_frames/adult.data.csv', header=None, sep=", ")

<ipython-input-77-1a3dffdc3737>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  data = pd.read_csv('../jupyter_pr/data_frames/adult.data.csv', header=None, sep=", ")

In [80]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [79]:
data = data.rename({0:'age', 1:'workclass', 2:'fnlwgt', 3:'education', 4:'education-num',
                     5:'marital-status', 6:'occupation', 7:'relationship', 8:'race',
                     9:'sex', 10:'capital-gain', 11:'capital-loss', 12:'hours-per-week',
                     13:'native-country', 14:'salary'}, axis=1)

In [28]:
data.groupby('sex', as_index=False).agg({'age':'mean'})

       sex        age
0   Female  36.858230
1     Male  39.433547

In [36]:
data['native-country'].value_counts(normalize=True).head()

 United-States    0.895857
 Mexico           0.019748
 ?                0.017905
 Philippines      0.006081
 Germany          0.004207
Name: native-country, dtype: float64

In [44]:
data.groupby('salary')['age'].describe()

          count       mean        std   min   25%   50%   75%   max
salary
 <=50K  24720.0  36.783738  14.020088  17.0  25.0  34.0  46.0  90.0
 >50K    7841.0  44.249841  10.519028  19.0  36.0  44.0  51.0  90.0

In [47]:
data.query('salary == " >50K"').education.unique()

array([' HS-grad', ' Masters', ' Bachelors', ' Some-college',
       ' Assoc-voc', ' Doctorate', ' Prof-school', ' Assoc-acdm',
       ' 7th-8th', ' 12th', ' 10th', ' 11th', ' 9th', ' 5th-6th',
       ' 1st-4th'], dtype=object)

In [61]:
data[(data.race == ' Amer-Indian-Eskimo') & (data.sex == ' Male')].sort_values('age', ascending=False).head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
12492,82,?,52921,Some-college,10,Widowed,?,Not-in-family,Amer-Indian-Eskimo,Male,0,0,3,United-States,<=50K
21410,74,?,33114,10th,6,Married-civ-spouse,?,Husband,Amer-Indian-Eskimo,Male,1797,0,30,United-States,<=50K
30057,71,Self-emp-not-inc,322789,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,Amer-Indian-Eskimo,Male,0,0,35,United-States,<=50K
10828,68,?,53850,7th-8th,4,Married-civ-spouse,?,Husband,Amer-Indian-Eskimo,Male,0,0,40,United-States,<=50K
6467,67,Private,126849,10th,6,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,0,0,20,United-States,<=50K

In [65]:
data.groupby('marital-status').salary.value_counts(normalize=True)

marital-status          salary
 Divorced                <=50K    0.895791
                         >50K     0.104209
 Married-AF-spouse       <=50K    0.565217
                         >50K     0.434783
 Married-civ-spouse      <=50K    0.553152
                         >50K     0.446848
 Married-spouse-absent   <=50K    0.918660
                         >50K     0.081340
 Never-married           <=50K    0.954039
                         >50K     0.045961
 Separated               <=50K    0.935610
                         >50K     0.064390
 Widowed                 <=50K    0.914401
                         >50K     0.085599
Name: salary, dtype: float64

In [71]:
data[data['hours-per-week'] == data['hours-per-week'].max()]['salary'].value_counts(normalize=True)

 <=50K    0.705882
 >50K     0.294118
Name: salary, dtype: float64

In [83]:
data[data['native-country'] == 'Japan'].groupby('salary').agg({'hours-per-week':'mean'})

        hours-per-week
salary
<=50K        41.000000
>50K         47.958333